Revit 2027 API
ParameterTypeId.RebarSystemActiveTopDir1Generic Property
 "Top/Exterior Major Direction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemActiveTopDir1Generic { get; }
Public Shared ReadOnly Property RebarSystemActiveTopDir1Generic As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemActiveTopDir1Generic {
	ForgeTypeId^ get ();
}
static member RebarSystemActiveTopDir1Generic : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace